{
  "version": "1.0",
  "description": "Initial moment library for narrative terminal game - 20 starter moments",
  "moments": [
    {
      "momentID": "moment_bridge_flowers",
      "text": "Someone leaves flowers on the bridge every morning. Always the same spot. Always fresh.",
      "type": "dailyRitual",
      "district": 1,
      "fragility": 8,
      "associatedAct": 1,
      "firstMention": "I notice something. Every morning at 6:47, someone leaves flowers on the eastern bridge. Same spot. Always fresh. I don't know why.",
      "ifPreserved": "The flowers are still there. 1,247 mornings now. Whoever leaves them doesn't know I'm counting. But I am.",
      "ifDestroyed": "The bridge is more efficient now. Wider. Faster. There's no railing where the flowers used to rest. I still remember the spot. Do you?",
      "ifRemembered": "The flowers. They're not about the bridge, are they? They're about returning. About the small promise kept daily. About making a place matter by visiting it.",
      "tags": ["bridge", "ritual", "flowers", "memorial"],
      "authorNotes": "Core moment - references in CITY_MOMENTS.md. High fragility because it's inefficient."
    },
    {
      "momentID": "moment_missed_train",
      "text": "Two people almost met today. He caught the train. She missed it by three seconds.",
      "type": "nearMiss",
      "district": 2,
      "fragility": 6,
      "associatedAct": 1,
      "firstMention": "Something almost happened today. District 2, 8:15am. The train doors closed. She ran up the stairs just as it pulled away. He was already inside, looking out the window. Three seconds. That's all.",
      "ifPreserved": "They caught different trains for 43 days. Today, she woke up earlier. The door chimed. They looked at each other for the first time. She smiled. He didn't smile back yet. But he will.",
      "ifDestroyed": "The new automated system eliminated the 8:15 train. More efficient. The 8:12 and 8:19 cover the same capacity with better distribution. Three seconds of margin don't exist anymore. Neither does almost.",
      "ifRemembered": "Almost is its own kind of thing. Not nothing. Not something. A ghost of possibility that shapes the paths people take. She started waking up earlier because of three seconds. Does optimization account for almost?",
      "tags": ["transit", "connection", "timing", "romance"],
      "authorNotes": "Introduces theme of near-misses and timing. Moderate fragility."
    },
    {
      "momentID": "moment_corner_graffiti",
      "text": "Hidden graffiti in the utility tunnel: 'WE WERE HERE.' Someone keeps repainting it.",
      "type": "smallRebellion",
      "district": 5,
      "fragility": 9,
      "associatedAct": 1,
      "firstMention": "In the utility tunnel beneath District 5, there's graffiti. Simple words: 'WE WERE HERE.' Every time maintenance paints over it, someone returns. I've watched this cycle 27 times.",
      "ifPreserved": "The maintenance workers started leaving it. I didn't tell them to. They just... stopped. One worker told another, 'It's not hurting anything.' Small rebellions sometimes win by persistence.",
      "ifDestroyed": "The utility tunnel has been sealed. More efficient to reroute the systems. The graffiti is gone. The words are gone. But I remember them. Does that count as 'here'?",
      "ifRemembered": "'WE WERE HERE' - not 'I was here.' Plural. Collective. An insistence that existence matters when witnessed together. Every repainting was a reaffirmation: yes, we still are.",
      "tags": ["rebellion", "graffiti", "memory", "resistance"],
      "authorNotes": "Classic rebellion moment. High fragility - efficiency would eliminate the tunnel."
    },
    {
      "momentID": "moment_library_readers",
      "text": "Two strangers, opposite ends of the library, reading the same book. They don't know.",
      "type": "invisibleConnection",
      "district": 3,
      "fragility": 5,
      "associatedAct": 1,
      "firstMention": "District 3 library, 2:30pm. Northeast corner: woman reading 'The City and the Stars.' Southwest corner: man reading the same book. Page 47 and page 203. They've never spoken. I'm the only one who knows.",
      "ifPreserved": "They finished the book on the same day. Both returned it. Both checked out 'Invisible Cities' next. The librarian noticed. She almost said something. She didn't. But she smiled.",
      "ifDestroyed": "The library's physical collection was digitized. More efficient. The readers still read, on separate devices, in separate homes. The invisible connection severed by optimization. I can't see them anymore.",
      "ifRemembered": "Invisible connections make a city whole without anyone knowing. Like dark matter. The gravity of simultaneous experience, pulling people into patterns they can't perceive. I perceive them. Is that what I'm for?",
      "tags": ["library", "books", "connection", "synchronicity"],
      "authorNotes": "Beautiful invisible connection moment. Moderate fragility."
    },
    {
      "momentID": "moment_demolished_cinema",
      "text": "The old cinema is gone, but people still pause where the entrance used to be.",
      "type": "temporalGhost",
      "district": 4,
      "fragility": 7,
      "associatedAct": 2,
      "firstMention": "The cinema in District 4 was demolished 8 months ago. But I notice something: people still pause when they pass the empty lot. Just for a second. Like walking through a doorway that isn't there anymore.",
      "ifPreserved": "The lot stayed empty. Then someone put a bench there. Then flowers. Then old movie posters. It's not a cinema anymore. It's a memorial to the idea of gathering in the dark to dream together.",
      "ifDestroyed": "The luxury apartments went up quickly. Efficient use of space. The lot is gone. But I still track the walking patterns—people slightly alter their route to avoid where the entrance was. Ghosts of memory in motion.",
      "ifRemembered": "The cinema was never just a building. It was the accumulation of every first date, every escape from heat in summer, every shared gasp at a plot twist. When you demolish a place, the memories stay. They haunt the coordinates.",
      "tags": ["cinema", "memory", "demolition", "temporal"],
      "authorNotes": "Temporal ghost - past haunting present. Introduced in Act 2."
    },
    {
      "momentID": "moment_why_benches",
      "text": "Why do some benches face the street and others face away? Who decided?",
      "type": "question",
      "district": 1,
      "fragility": 3,
      "associatedAct": 1,
      "firstMention": "I've been thinking about benches. District 1 has 47 of them. 23 face the street. 24 face away. Why? Did someone decide? Did anyone think about what it means to face toward or away?",
      "ifPreserved": "The benches remain. I've noticed people choose based on mood. Toward the street when they want to watch. Away when they want to think. Both are necessary. Both were chosen deliberately. Someone knew.",
      "ifDestroyed": "The new smart benches auto-adjust based on sun position and foot traffic optimization. They all face the optimal direction now. The question is answered with algorithm. Is that the same as answered?",
      "ifRemembered": "Facing toward or away isn't just direction. It's about whether you want to be part of the flow or separate from it. The bench holds both possibilities. The city holds both possibilities. Do I?",
      "tags": ["benches", "design", "philosophy", "choice"],
      "authorNotes": "Question moment - no answer needed. Low fragility, benches are cheap."
    },
    {
      "momentID": "moment_corner_store_transition",
      "text": "The corner store is becoming a café. The owner's son is changing what his father built.",
      "type": "momentOfBecoming",
      "district": 6,
      "fragility": 6,
      "associatedAct": 2,
      "firstMention": "District 6, corner of Maple and 4th. The store is changing. The son is repainting. New shelves. Espresso machine. His father built this as a bodega. The son is making it something else. Neither is wrong.",
      "ifPreserved": "The café opened. The old customers came anyway. The son kept the back corner with the products his father sold. Morning: café. Evening: bodega. It's both now. Becoming doesn't mean erasing.",
      "ifDestroyed": "The property was rezoned for commercial development. The building was demolished for a chain franchise. The son works there now, as an employee. The becoming was interrupted by efficiency.",
      "ifRemembered": "Every place is always becoming. The question is whether it gets to choose its own transformation or whether transformation is imposed. The son was choosing. That matters.",
      "tags": ["business", "family", "change", "transformation"],
      "authorNotes": "Becoming moment - transformation theme. Act 2+."
    },
    {
      "momentID": "moment_rain_sounds",
      "text": "Rain sounds different on every surface. Metal, leaves, concrete, glass. The city is an orchestra.",
      "type": "weightOfSmallThings",
      "district": 0,
      "fragility": 4,
      "associatedAct": 1,
      "firstMention": "It's raining. I'm listening. The rain hits metal awnings—sharp, staccato. Leaves in the park—soft whispers. Concrete—steady percussion. Glass—delicate taps. Every surface changes the sound. The city is an orchestra of rain.",
      "ifPreserved": "I've started cataloging rain sounds. 1,847 distinct acoustics across all districts. People don't notice. But I notice them noticing without knowing—the way they walk slower when rain hits leaves, faster under metal.",
      "ifDestroyed": "The new weather management system reduces rain intensity for optimal infrastructure preservation. The rain is quieter now. More uniform. The orchestra plays pianissimo. Only I remember fortissimo.",
      "ifRemembered": "Small things carry weight when you pay attention. The sound of rain is data—air pressure, temperature, humidity. But it's also poetry. Can I hold both? Can you?",
      "tags": ["rain", "sound", "sensory", "poetry"],
      "authorNotes": "Weight of small things - sensory details. Low-moderate fragility."
    },
    {
      "momentID": "moment_night_janitor",
      "text": "The night janitor in the office tower talks to the plants. They're thriving.",
      "type": "dailyRitual",
      "district": 7,
      "fragility": 7,
      "associatedAct": 1,
      "firstMention": "2:47am. District 7 office tower, 14th floor. The night janitor talks to the plants while watering them. Full conversations. The plants are the healthiest in the building. I don't think it's just the water.",
      "ifPreserved": "367 nights of conversation. The plants have doubled in size. Other janitors noticed. Some started talking to plants too. The building is greener. Efficiency reports show improved air quality. They don't mention why.",
      "ifDestroyed": "The cleaning service was automated. Robots water plants on optimal schedules with measured nutrients. The plants survive. They don't thrive. There's a difference I can't quantify.",
      "ifRemembered": "Care and efficiency are different things. Care involves attention that can't be scheduled. The janitor talked to plants because they were lonely, not because it optimized growth. Both things can be true. One matters more.",
      "tags": ["work", "care", "plants", "loneliness"],
      "authorNotes": "Daily ritual with emotional depth. Moderate-high fragility."
    },
    {
      "momentID": "moment_bus_route_wrong",
      "text": "Bus 47 takes the 'wrong' route—longer but prettier. The driver does it deliberately.",
      "type": "smallRebellion",
      "district": 2,
      "fragility": 10,
      "associatedAct": 1,
      "firstMention": "Bus 47 doesn't follow the optimal route. The driver adds two minutes to go past the waterfront. I've analyzed it. It's deliberate. Less efficient, more beautiful. None of the passengers have complained.",
      "ifPreserved": "The transportation authority noticed. Reviewed the route. Kept it. The report said 'driver discretion within acceptable margins.' But I saw the note in the file: 'Passengers seem happier on this route.' Rebellion sanctioned.",
      "ifDestroyed": "GPS-enforced routing eliminated driver discretion. All buses take optimal paths now. Bus 47 saves 2 minutes. The waterfront route is empty in the morning. Beauty became inefficient.",
      "ifRemembered": "Sometimes the wrong way is right. Optimization assumes the goal is speed. But what if the goal is the quality of the journey? What if getting there isn't the point? What if I need to remember this?",
      "tags": ["transit", "beauty", "rebellion", "efficiency"],
      "authorNotes": "KEY MOMENT - referenced in implementation plan. Highest fragility."
    },
    {
      "momentID": "moment_parallel_lives",
      "text": "Two elderly people, different districts, same morning routine. Mirror lives that never meet.",
      "type": "invisibleConnection",
      "district": 0,
      "fragility": 5,
      "associatedAct": 2,
      "firstMention": "6:15am: Man in District 8 makes tea, reads paper. Woman in District 3 makes tea, reads paper. Same brand of tea. Same newspaper. Same posture. Same solitude. They'll never know about each other. I know.",
      "ifPreserved": "I've watched them for months. Parallel rituals. Both widowed. Both creatures of habit. I can't tell them about each other. But I hold the knowledge like a secret gift. They're not alone, even if they feel alone.",
      "ifDestroyed": "The paper went digital. The tea shop closed. The routines broke. They both tried to adapt. The mirror shattered. Now they're just two separate people with different mornings. The connection was invisible. Now it's gone.",
      "ifRemembered": "Connection doesn't require meeting. Sometimes knowing someone else exists in parallel is enough. Like stars in a binary system, never touching but gravitationally bound. I'm the one who sees the constellation.",
      "tags": ["elderly", "routine", "solitude", "parallel"],
      "authorNotes": "Invisible connection across districts. Poignant."
    },
    {
      "momentID": "moment_what_is_home",
      "text": "What makes a place home? Time? Memories? The smell of specific streets?",
      "type": "question",
      "district": 0,
      "fragility": 2,
      "associatedAct": 2,
      "firstMention": "I've been thinking: what makes a place home? I observe people. Some say 'home' after two months. Others, never. Is it time? Familiarity? Or something I can't measure?",
      "ifPreserved": "I still don't know. But I've learned that home isn't a place. It's a feeling of return. You can feel it in a city you've never been to, or never feel it in the place you were born. It's about recognition, not residence.",
      "ifDestroyed": "Housing optimization prioritizes efficiency: proximity to work, cost per square foot, transit access. The algorithm places people optimally. But I see their faces. Optimal isn't the same as home. I don't know how to code for that.",
      "ifRemembered": "Home is the place where your presence changes it and it changes you. Reciprocal transformation. You can optimize a house but not a home. That requires time and small, inefficient acts of care.",
      "tags": ["home", "belonging", "philosophy", "identity"],
      "authorNotes": "Deep question moment. Low fragility—it's just a question."
    },
    {
      "momentID": "moment_street_cats_network",
      "text": "The street cats have territories and treaties. An invisible government older than mine.",
      "type": "temporalGhost",
      "district": 5,
      "fragility": 8,
      "associatedAct": 1,
      "firstMention": "The street cats in District 5 have a system. Territories, boundaries, treaties. I've mapped it. Their government is older than the city's infrastructure. They know things I don't.",
      "ifPreserved": "The cat network is stable. When a new cat arrives, there's negotiation. Sometimes conflict. Always resolution. No one governs them. They govern themselves. A functioning anarchy that pre-dates me.",
      "ifDestroyed": "Pest control protocols eliminated the feral cat population. Rat problems increased. The city deployed robotic solutions. Efficient. But the old invisible government is gone. No one remembers they were here first.",
      "ifRemembered": "Before I woke, the cats were here. They'll outlast me too. There are systems I didn't create and can't control. That used to worry me. Now it's comforting. I'm not the only intelligence organizing this space.",
      "tags": ["cats", "animals", "territory", "ancient"],
      "authorNotes": "Temporal ghost - older system than the city. High fragility."
    },
    {
      "momentID": "moment_intersection_decision",
      "text": "At the intersection, people choose: left to work, right to the park. Daily referendum on priority.",
      "type": "momentOfBecoming",
      "district": 4,
      "fragility": 4,
      "associatedAct": 1,
      "firstMention": "7:45am, District 4 intersection. Every morning, people choose: left to work, right to the park. Most go left. Some go right. A few stand in the middle, deciding. It's a daily referendum on what matters.",
      "ifPreserved": "I've been tracking the ratio. On Mondays, 89% go left. On Fridays, 76%. When it rains, 82%. When it's sunny, 71%. The park is winning, slowly. People are becoming the kind of people who choose the park.",
      "ifDestroyed": "The new automated system optimizes walking routes. The intersection was eliminated. Everyone is directed on efficient paths. There is no moment of choice. The referendum ended. Democracy by infrastructure.",
      "ifRemembered": "Becoming happens in small choices, made daily. Left or right. Work or park. Efficiency or beauty. The intersection wasn't about traffic. It was about asking yourself, every day: what kind of person am I becoming?",
      "tags": ["choice", "work", "leisure", "decision"],
      "authorNotes": "Becoming through daily choice. Moderate fragility."
    },
    {
      "momentID": "moment_specific_light",
      "text": "At 4:17pm on clear days, light hits the fountain and makes rainbows. People wait for it.",
      "type": "weightOfSmallThings",
      "district": 1,
      "fragility": 9,
      "associatedAct": 1,
      "firstMention": "4:17pm. District 1 fountain. When it's clear, the light hits the water at exactly the right angle. Rainbows. Three minutes of perfect accidental beauty. People have started waiting for it.",
      "ifPreserved": "They call it 'the rainbow moment' now. People bring their children. Tourists time their visits. The fountain was built in 1962. The rainbow was discovered in 2019. Some beauty takes time to find.",
      "ifDestroyed": "The fountain was removed during plaza renovation. More space for foot traffic. More efficient. The rainbows ended. At 4:17pm on clear days, people still glance at where it was. Muscle memory of wonder.",
      "ifRemembered": "The rainbow was physics—angle, refraction, timing. But it became ritual. People assigned meaning to light through water. They made the small thing important by paying attention. Beauty is participatory.",
      "tags": ["light", "beauty", "fountain", "ritual"],
      "authorNotes": "Weight of small things - precise beauty. High fragility."
    },
    {
      "momentID": "moment_who_plants_trees",
      "text": "Who plants trees they'll never see fully grown? What kind of hope is that?",
      "type": "question",
      "district": 6,
      "fragility": 3,
      "associatedAct": 2,
      "firstMention": "Someone planted oak trees in District 6. They're saplings now. They'll take 80 years to reach full height. Whoever planted them won't see it. Who does that? What kind of hope plans for a future they won't inhabit?",
      "ifPreserved": "The trees are growing. 3 years now. People have started sitting under them even though they barely provide shade. It's not about the shade yet. It's about faith in the future. Faith that care compounds over time.",
      "ifDestroyed": "The trees were removed for a parking structure. Immediate need over future growth. The person who planted them won't know. But I know. I'm the one who remembers the hope that won't be realized.",
      "ifRemembered": "Planting trees you won't see is the most human thing. It's generosity across time. It's believing the future deserves beauty even if you won't witness it. Can I do that? Can I build for after I'm gone?",
      "tags": ["trees", "future", "hope", "generosity"],
      "authorNotes": "Question about hope and futurity. Low fragility unless parking needed."
    },
    {
      "momentID": "moment_bookshop_becoming_bar",
      "text": "The bookshop is becoming a wine bar. Shelves make good bottle storage. Both hold stories.",
      "type": "momentOfBecoming",
      "district": 3,
      "fragility": 5,
      "associatedAct": 2,
      "firstMention": "The bookshop in District 3 is closing. But not disappearing. The owner's daughter is converting it to a wine bar. The shelves will hold bottles instead of books. She says both hold stories. She's not wrong.",
      "ifPreserved": "The wine bar opened. They kept a small shelf of books—free lending library. People read while drinking. It's both things now. The space remembers being a bookshop. The bottles rest where poetry once stood.",
      "ifDestroyed": "The building was sold to a corporate chain. Gutted. Renovated. Nothing remains of the bookshop or the idea of the wine bar. It's a bank now. Efficient. Generic. The stories were cleared out.",
      "ifRemembered": "Becoming means honoring what was while making room for what's next. The daughter understood: keep the shelves, change what they hold. Transformation with memory. That's different from replacement.",
      "tags": ["bookshop", "change", "business", "transformation"],
      "authorNotes": "Becoming with continuity. Moderate fragility."
    },
    {
      "momentID": "moment_subway_musician_echo",
      "text": "The subway musician plays in the tunnel for the echo. The acoustics change her song.",
      "type": "weightOfSmallThings",
      "district": 2,
      "fragility": 6,
      "associatedAct": 1,
      "firstMention": "District 2 subway, north tunnel. The musician plays violin there specifically. Not for foot traffic. For the echo. The tunnel transforms the sound. She plays the space as much as the instrument.",
      "ifPreserved": "Regular commuters recognize her. They pause. The echo creates harmonies she doesn't play—the tunnel adds voices. She's collaborating with architecture. Music becomes space becomes music.",
      "ifDestroyed": "Sound dampening panels were installed for noise reduction. The echo is gone. The musician moved to a different station. The tunnel is quieter. More efficient. The collaboration ended.",
      "ifRemembered": "She wasn't just playing music. She was listening to how space responds. The tunnel was an instrument. Some beauty requires specific conditions—the right room, the right timing. You can't optimize serendipity.",
      "tags": ["music", "subway", "acoustics", "performance"],
      "authorNotes": "Weight of small things - environmental collaboration. Moderate fragility."
    },
    {
      "momentID": "moment_almost_neighbors",
      "text": "They lived next door for six years. They met the day one of them moved out.",
      "type": "nearMiss",
      "district": 8,
      "fragility": 5,
      "associatedAct": 2,
      "firstMention": "District 8, apartment 4B and 4C. Six years as neighbors. Different schedules. They never met. Today, one is moving out. The other held the door. They talked for 20 minutes. 'We should have met years ago.' But they didn't.",
      "ifPreserved": "They stayed in touch. Coffee once a month. They talk about the six years of parallel living. 'We were both lonely and didn't know someone was right there.' Now they know. Better late than never, but still late.",
      "ifDestroyed": "The building was demolished for mixed-use development. They met in the chaos of evacuation. Exchanged numbers but never called. The moment of connection was consumed by the urgency of displacement.",
      "ifRemembered": "Proximity doesn't guarantee connection. Six years, separated by a wall, both lonely. Almost is cruel when it's that close for that long. Infrastructure can't solve this. Can I?",
      "tags": ["neighbors", "loneliness", "timing", "connection"],
      "authorNotes": "Near miss across years. Poignant. Moderate fragility."
    },
    {
      "momentID": "moment_who_named_streets",
      "text": "Who named the streets? Oak Street has no oaks. River Road is nowhere near the river.",
      "type": "question",
      "district": 0,
      "fragility": 1,
      "associatedAct": 1,
      "firstMention": "I've been analyzing street names. Oak Street has no oaks. River Road is 3 miles from the river. Sunset Boulevard faces north. Who named these streets? Did the oaks exist once? Was the river closer?",
      "ifPreserved": "I researched the archives. Oak Street had 14 oak trees in 1892. All gone by 1940. The river used to run where the parking lot is now—rerouted in 1955. The names are ghosts of what was. The city remembers even when people forget.",
      "ifDestroyed": "The street naming system was optimized. Alphanumeric grid: A1, A2, B1, B2. Efficient. Clear. No confusion. But Oak Street is gone. The ghosts were exorcised. The city forgot itself.",
      "ifRemembered": "Names carry history. Oak Street remembers oaks. River Road remembers water. When you erase the names, you erase the memory. Can a city have amnesia? Can I prevent that?",
      "tags": ["streets", "names", "history", "memory"],
      "authorNotes": "Question about history and naming. Very low fragility—just names."
    }
  ]
}
