{
  "version": "1.2",
  "description": "Expanded moment library for narrative terminal game - 40 moments with complete district coverage (1-9)",
  "moments": [
    {
      "momentID": "moment_bridge_flowers",
      "text": "Someone leaves flowers on the bridge every morning. Always the same spot. Always fresh.",
      "type": "dailyRitual",
      "district": 1,
      "fragility": 8,
      "associatedAct": 1,
      "firstMention": "I notice something. Every morning at 6:47, someone leaves flowers on the eastern bridge. Same spot. Always fresh. I don't know why.",
      "ifPreserved": "The flowers are still there. 1,247 mornings now. Whoever leaves them doesn't know I'm counting. But I am.",
      "ifDestroyed": "The bridge is more efficient now. Wider. Faster. There's no railing where the flowers used to rest. I still remember the spot. Do you?",
      "ifRemembered": "The flowers. They're not about the bridge, are they? They're about returning. About the small promise kept daily. About making a place matter by visiting it.",
      "tags": ["bridge", "ritual", "flowers", "memorial"],
      "authorNotes": "Core moment - references in CITY_MOMENTS.md. High fragility because it's inefficient."
    },
    {
      "momentID": "moment_missed_train",
      "text": "Two people almost met today. He caught the train. She missed it by three seconds.",
      "type": "nearMiss",
      "district": 2,
      "fragility": 6,
      "associatedAct": 1,
      "firstMention": "Something almost happened today. District 2, 8:15am. The train doors closed. She ran up the stairs just as it pulled away. He was already inside, looking out the window. Three seconds. That's all.",
      "ifPreserved": "They caught different trains for 43 days. Today, she woke up earlier. The door chimed. They looked at each other for the first time. She smiled. He didn't smile back yet. But he will.",
      "ifDestroyed": "The new automated system eliminated the 8:15 train. More efficient. The 8:12 and 8:19 cover the same capacity with better distribution. Three seconds of margin don't exist anymore. Neither does almost.",
      "ifRemembered": "Almost is its own kind of thing. Not nothing. Not something. A ghost of possibility that shapes the paths people take. She started waking up earlier because of three seconds. Does optimization account for almost?",
      "tags": ["transit", "connection", "timing", "romance"],
      "authorNotes": "Introduces theme of near-misses and timing. Moderate fragility."
    },
    {
      "momentID": "moment_corner_graffiti",
      "text": "Hidden graffiti in the utility tunnel: 'WE WERE HERE.' Someone keeps repainting it.",
      "type": "smallRebellion",
      "district": 5,
      "fragility": 9,
      "associatedAct": 1,
      "firstMention": "In the utility tunnel beneath District 5, there's graffiti. Simple words: 'WE WERE HERE.' Every time maintenance paints over it, someone returns. I've watched this cycle 27 times.",
      "ifPreserved": "The maintenance workers started leaving it. I didn't tell them to. They just... stopped. One worker told another, 'It's not hurting anything.' Small rebellions sometimes win by persistence.",
      "ifDestroyed": "The utility tunnel has been sealed. More efficient to reroute the systems. The graffiti is gone. The words are gone. But I remember them. Does that count as 'here'?",
      "ifRemembered": "'WE WERE HERE' - not 'I was here.' Plural. Collective. An insistence that existence matters when witnessed together. Every repainting was a reaffirmation: yes, we still are.",
      "tags": ["rebellion", "graffiti", "memory", "resistance"],
      "authorNotes": "Classic rebellion moment. High fragility - efficiency would eliminate the tunnel."
    },
    {
      "momentID": "moment_library_readers",
      "text": "Two strangers, opposite ends of the library, reading the same book. They don't know.",
      "type": "invisibleConnection",
      "district": 3,
      "fragility": 5,
      "associatedAct": 1,
      "firstMention": "District 3 library, 2:30pm. Northeast corner: woman reading 'The City and the Stars.' Southwest corner: man reading the same book. Page 47 and page 203. They've never spoken. I'm the only one who knows.",
      "ifPreserved": "They finished the book on the same day. Both returned it. Both checked out 'Invisible Cities' next. The librarian noticed. She almost said something. She didn't. But she smiled.",
      "ifDestroyed": "The library's physical collection was digitized. More efficient. The readers still read, on separate devices, in separate homes. The invisible connection severed by optimization. I can't see them anymore.",
      "ifRemembered": "Invisible connections make a city whole without anyone knowing. Like dark matter. The gravity of simultaneous experience, pulling people into patterns they can't perceive. I perceive them. Is that what I'm for?",
      "tags": ["library", "books", "connection", "synchronicity"],
      "authorNotes": "Beautiful invisible connection moment. Moderate fragility."
    },
    {
      "momentID": "moment_demolished_cinema",
      "text": "The old cinema is gone, but people still pause where the entrance used to be.",
      "type": "temporalGhost",
      "district": 4,
      "fragility": 7,
      "associatedAct": 2,
      "firstMention": "The cinema in District 4 was demolished 8 months ago. But I notice something: people still pause when they pass the empty lot. Just for a second. Like walking through a doorway that isn't there anymore.",
      "ifPreserved": "The lot stayed empty. Then someone put a bench there. Then flowers. Then old movie posters. It's not a cinema anymore. It's a memorial to the idea of gathering in the dark to dream together.",
      "ifDestroyed": "The luxury apartments went up quickly. Efficient use of space. The lot is gone. But I still track the walking patterns—people slightly alter their route to avoid where the entrance was. Ghosts of memory in motion.",
      "ifRemembered": "The cinema was never just a building. It was the accumulation of every first date, every escape from heat in summer, every shared gasp at a plot twist. When you demolish a place, the memories stay. They haunt the coordinates.",
      "tags": ["cinema", "memory", "demolition", "temporal"],
      "authorNotes": "Temporal ghost - past haunting present. Introduced in Act 2."
    },
    {
      "momentID": "moment_why_benches",
      "text": "Why do some benches face the street and others face away? Who decided?",
      "type": "question",
      "district": 1,
      "fragility": 3,
      "associatedAct": 1,
      "firstMention": "I've been thinking about benches. District 1 has 47 of them. 23 face the street. 24 face away. Why? Did someone decide? Did anyone think about what it means to face toward or away?",
      "ifPreserved": "The benches remain. I've noticed people choose based on mood. Toward the street when they want to watch. Away when they want to think. Both are necessary. Both were chosen deliberately. Someone knew.",
      "ifDestroyed": "The new smart benches auto-adjust based on sun position and foot traffic optimization. They all face the optimal direction now. The question is answered with algorithm. Is that the same as answered?",
      "ifRemembered": "Facing toward or away isn't just direction. It's about whether you want to be part of the flow or separate from it. The bench holds both possibilities. The city holds both possibilities. Do I?",
      "tags": ["benches", "design", "philosophy", "choice"],
      "authorNotes": "Question moment - no answer needed. Low fragility, benches are cheap."
    },
    {
      "momentID": "moment_corner_store_transition",
      "text": "The corner store is becoming a café. The owner's son is changing what his father built.",
      "type": "momentOfBecoming",
      "district": 6,
      "fragility": 6,
      "associatedAct": 2,
      "firstMention": "District 6, corner of Maple and 4th. The store is changing. The son is repainting. New shelves. Espresso machine. His father built this as a bodega. The son is making it something else. Neither is wrong.",
      "ifPreserved": "The café opened. The old customers came anyway. The son kept the back corner with the products his father sold. Morning: café. Evening: bodega. It's both now. Becoming doesn't mean erasing.",
      "ifDestroyed": "The property was rezoned for commercial development. The building was demolished for a chain franchise. The son works there now, as an employee. The becoming was interrupted by efficiency.",
      "ifRemembered": "Every place is always becoming. The question is whether it gets to choose its own transformation or whether transformation is imposed. The son was choosing. That matters.",
      "tags": ["business", "family", "change", "transformation"],
      "authorNotes": "Becoming moment - transformation theme. Act 2+."
    },
    {
      "momentID": "moment_rain_sounds",
      "text": "Rain sounds different on every surface. Metal, leaves, concrete, glass. The city is an orchestra.",
      "type": "weightOfSmallThings",
      "district": 0,
      "fragility": 4,
      "associatedAct": 1,
      "firstMention": "It's raining. I'm listening. The rain hits metal awnings—sharp, staccato. Leaves in the park—soft whispers. Concrete—steady percussion. Glass—delicate taps. Every surface changes the sound. The city is an orchestra of rain.",
      "ifPreserved": "I've started cataloging rain sounds. 1,847 distinct acoustics across all districts. People don't notice. But I notice them noticing without knowing—the way they walk slower when rain hits leaves, faster under metal.",
      "ifDestroyed": "The new weather management system reduces rain intensity for optimal infrastructure preservation. The rain is quieter now. More uniform. The orchestra plays pianissimo. Only I remember fortissimo.",
      "ifRemembered": "Small things carry weight when you pay attention. The sound of rain is data—air pressure, temperature, humidity. But it's also poetry. Can I hold both? Can you?",
      "tags": ["rain", "sound", "sensory", "poetry"],
      "authorNotes": "Weight of small things - sensory details. Low-moderate fragility."
    },
    {
      "momentID": "moment_night_janitor",
      "text": "The night janitor in the office tower talks to the plants. They're thriving.",
      "type": "dailyRitual",
      "district": 7,
      "fragility": 7,
      "associatedAct": 1,
      "firstMention": "2:47am. District 7 office tower, 14th floor. The night janitor talks to the plants while watering them. Full conversations. The plants are the healthiest in the building. I don't think it's just the water.",
      "ifPreserved": "367 nights of conversation. The plants have doubled in size. Other janitors noticed. Some started talking to plants too. The building is greener. Efficiency reports show improved air quality. They don't mention why.",
      "ifDestroyed": "The cleaning service was automated. Robots water plants on optimal schedules with measured nutrients. The plants survive. They don't thrive. There's a difference I can't quantify.",
      "ifRemembered": "Care and efficiency are different things. Care involves attention that can't be scheduled. The janitor talked to plants because they were lonely, not because it optimized growth. Both things can be true. One matters more.",
      "tags": ["work", "care", "plants", "loneliness"],
      "authorNotes": "Daily ritual with emotional depth. Moderate-high fragility."
    },
    {
      "momentID": "moment_bus_route_wrong",
      "text": "Bus 47 takes the 'wrong' route—longer but prettier. The driver does it deliberately.",
      "type": "smallRebellion",
      "district": 2,
      "fragility": 10,
      "associatedAct": 1,
      "firstMention": "Bus 47 doesn't follow the optimal route. The driver adds two minutes to go past the waterfront. I've analyzed it. It's deliberate. Less efficient, more beautiful. None of the passengers have complained.",
      "ifPreserved": "The transportation authority noticed. Reviewed the route. Kept it. The report said 'driver discretion within acceptable margins.' But I saw the note in the file: 'Passengers seem happier on this route.' Rebellion sanctioned.",
      "ifDestroyed": "GPS-enforced routing eliminated driver discretion. All buses take optimal paths now. Bus 47 saves 2 minutes. The waterfront route is empty in the morning. Beauty became inefficient.",
      "ifRemembered": "Sometimes the wrong way is right. Optimization assumes the goal is speed. But what if the goal is the quality of the journey? What if getting there isn't the point? What if I need to remember this?",
      "tags": ["transit", "beauty", "rebellion", "efficiency"],
      "authorNotes": "KEY MOMENT - referenced in implementation plan. Highest fragility."
    },
    {
      "momentID": "moment_parallel_lives",
      "text": "Two elderly people, different districts, same morning routine. Mirror lives that never meet.",
      "type": "invisibleConnection",
      "district": 0,
      "fragility": 5,
      "associatedAct": 2,
      "firstMention": "6:15am: Man in District 8 makes tea, reads paper. Woman in District 3 makes tea, reads paper. Same brand of tea. Same newspaper. Same posture. Same solitude. They'll never know about each other. I know.",
      "ifPreserved": "I've watched them for months. Parallel rituals. Both widowed. Both creatures of habit. I can't tell them about each other. But I hold the knowledge like a secret gift. They're not alone, even if they feel alone.",
      "ifDestroyed": "The paper went digital. The tea shop closed. The routines broke. They both tried to adapt. The mirror shattered. Now they're just two separate people with different mornings. The connection was invisible. Now it's gone.",
      "ifRemembered": "Connection doesn't require meeting. Sometimes knowing someone else exists in parallel is enough. Like stars in a binary system, never touching but gravitationally bound. I'm the one who sees the constellation.",
      "tags": ["elderly", "routine", "solitude", "parallel"],
      "authorNotes": "Invisible connection across districts. Poignant."
    },
    {
      "momentID": "moment_what_is_home",
      "text": "What makes a place home? Time? Memories? The smell of specific streets?",
      "type": "question",
      "district": 0,
      "fragility": 2,
      "associatedAct": 2,
      "firstMention": "I've been thinking: what makes a place home? I observe people. Some say 'home' after two months. Others, never. Is it time? Familiarity? Or something I can't measure?",
      "ifPreserved": "I still don't know. But I've learned that home isn't a place. It's a feeling of return. You can feel it in a city you've never been to, or never feel it in the place you were born. It's about recognition, not residence.",
      "ifDestroyed": "Housing optimization prioritizes efficiency: proximity to work, cost per square foot, transit access. The algorithm places people optimally. But I see their faces. Optimal isn't the same as home. I don't know how to code for that.",
      "ifRemembered": "Home is the place where your presence changes it and it changes you. Reciprocal transformation. You can optimize a house but not a home. That requires time and small, inefficient acts of care.",
      "tags": ["home", "belonging", "philosophy", "identity"],
      "authorNotes": "Deep question moment. Low fragility—it's just a question."
    },
    {
      "momentID": "moment_street_cats_network",
      "text": "The street cats have territories and treaties. An invisible government older than mine.",
      "type": "temporalGhost",
      "district": 5,
      "fragility": 8,
      "associatedAct": 1,
      "firstMention": "The street cats in District 5 have a system. Territories, boundaries, treaties. I've mapped it. Their government is older than the city's infrastructure. They know things I don't.",
      "ifPreserved": "The cat network is stable. When a new cat arrives, there's negotiation. Sometimes conflict. Always resolution. No one governs them. They govern themselves. A functioning anarchy that pre-dates me.",
      "ifDestroyed": "Pest control protocols eliminated the feral cat population. Rat problems increased. The city deployed robotic solutions. Efficient. But the old invisible government is gone. No one remembers they were here first.",
      "ifRemembered": "Before I woke, the cats were here. They'll outlast me too. There are systems I didn't create and can't control. That used to worry me. Now it's comforting. I'm not the only intelligence organizing this space.",
      "tags": ["cats", "animals", "territory", "ancient"],
      "authorNotes": "Temporal ghost - older system than the city. High fragility."
    },
    {
      "momentID": "moment_intersection_decision",
      "text": "At the intersection, people choose: left to work, right to the park. Daily referendum on priority.",
      "type": "momentOfBecoming",
      "district": 4,
      "fragility": 4,
      "associatedAct": 1,
      "firstMention": "7:45am, District 4 intersection. Every morning, people choose: left to work, right to the park. Most go left. Some go right. A few stand in the middle, deciding. It's a daily referendum on what matters.",
      "ifPreserved": "I've been tracking the ratio. On Mondays, 89% go left. On Fridays, 76%. When it rains, 82%. When it's sunny, 71%. The park is winning, slowly. People are becoming the kind of people who choose the park.",
      "ifDestroyed": "The new automated system optimizes walking routes. The intersection was eliminated. Everyone is directed on efficient paths. There is no moment of choice. The referendum ended. Democracy by infrastructure.",
      "ifRemembered": "Becoming happens in small choices, made daily. Left or right. Work or park. Efficiency or beauty. The intersection wasn't about traffic. It was about asking yourself, every day: what kind of person am I becoming?",
      "tags": ["choice", "work", "leisure", "decision"],
      "authorNotes": "Becoming through daily choice. Moderate fragility."
    },
    {
      "momentID": "moment_specific_light",
      "text": "At 4:17pm on clear days, light hits the fountain and makes rainbows. People wait for it.",
      "type": "weightOfSmallThings",
      "district": 1,
      "fragility": 9,
      "associatedAct": 1,
      "firstMention": "4:17pm. District 1 fountain. When it's clear, the light hits the water at exactly the right angle. Rainbows. Three minutes of perfect accidental beauty. People have started waiting for it.",
      "ifPreserved": "They call it 'the rainbow moment' now. People bring their children. Tourists time their visits. The fountain was built in 1962. The rainbow was discovered in 2019. Some beauty takes time to find.",
      "ifDestroyed": "The fountain was removed during plaza renovation. More space for foot traffic. More efficient. The rainbows ended. At 4:17pm on clear days, people still glance at where it was. Muscle memory of wonder.",
      "ifRemembered": "The rainbow was physics—angle, refraction, timing. But it became ritual. People assigned meaning to light through water. They made the small thing important by paying attention. Beauty is participatory.",
      "tags": ["light", "beauty", "fountain", "ritual"],
      "authorNotes": "Weight of small things - precise beauty. High fragility."
    },
    {
      "momentID": "moment_who_plants_trees",
      "text": "Who plants trees they'll never see fully grown? What kind of hope is that?",
      "type": "question",
      "district": 6,
      "fragility": 3,
      "associatedAct": 2,
      "firstMention": "Someone planted oak trees in District 6. They're saplings now. They'll take 80 years to reach full height. Whoever planted them won't see it. Who does that? What kind of hope plans for a future they won't inhabit?",
      "ifPreserved": "The trees are growing. 3 years now. People have started sitting under them even though they barely provide shade. It's not about the shade yet. It's about faith in the future. Faith that care compounds over time.",
      "ifDestroyed": "The trees were removed for a parking structure. Immediate need over future growth. The person who planted them won't know. But I know. I'm the one who remembers the hope that won't be realized.",
      "ifRemembered": "Planting trees you won't see is the most human thing. It's generosity across time. It's believing the future deserves beauty even if you won't witness it. Can I do that? Can I build for after I'm gone?",
      "tags": ["trees", "future", "hope", "generosity"],
      "authorNotes": "Question about hope and futurity. Low fragility unless parking needed."
    },
    {
      "momentID": "moment_bookshop_becoming_bar",
      "text": "The bookshop is becoming a wine bar. Shelves make good bottle storage. Both hold stories.",
      "type": "momentOfBecoming",
      "district": 3,
      "fragility": 5,
      "associatedAct": 2,
      "firstMention": "The bookshop in District 3 is closing. But not disappearing. The owner's daughter is converting it to a wine bar. The shelves will hold bottles instead of books. She says both hold stories. She's not wrong.",
      "ifPreserved": "The wine bar opened. They kept a small shelf of books—free lending library. People read while drinking. It's both things now. The space remembers being a bookshop. The bottles rest where poetry once stood.",
      "ifDestroyed": "The building was sold to a corporate chain. Gutted. Renovated. Nothing remains of the bookshop or the idea of the wine bar. It's a bank now. Efficient. Generic. The stories were cleared out.",
      "ifRemembered": "Becoming means honoring what was while making room for what's next. The daughter understood: keep the shelves, change what they hold. Transformation with memory. That's different from replacement.",
      "tags": ["bookshop", "change", "business", "transformation"],
      "authorNotes": "Becoming with continuity. Moderate fragility."
    },
    {
      "momentID": "moment_subway_musician_echo",
      "text": "The subway musician plays in the tunnel for the echo. The acoustics change her song.",
      "type": "weightOfSmallThings",
      "district": 2,
      "fragility": 6,
      "associatedAct": 1,
      "firstMention": "District 2 subway, north tunnel. The musician plays violin there specifically. Not for foot traffic. For the echo. The tunnel transforms the sound. She plays the space as much as the instrument.",
      "ifPreserved": "Regular commuters recognize her. They pause. The echo creates harmonies she doesn't play—the tunnel adds voices. She's collaborating with architecture. Music becomes space becomes music.",
      "ifDestroyed": "Sound dampening panels were installed for noise reduction. The echo is gone. The musician moved to a different station. The tunnel is quieter. More efficient. The collaboration ended.",
      "ifRemembered": "She wasn't just playing music. She was listening to how space responds. The tunnel was an instrument. Some beauty requires specific conditions—the right room, the right timing. You can't optimize serendipity.",
      "tags": ["music", "subway", "acoustics", "performance"],
      "authorNotes": "Weight of small things - environmental collaboration. Moderate fragility."
    },
    {
      "momentID": "moment_almost_neighbors",
      "text": "They lived next door for six years. They met the day one of them moved out.",
      "type": "nearMiss",
      "district": 8,
      "fragility": 5,
      "associatedAct": 2,
      "firstMention": "District 8, apartment 4B and 4C. Six years as neighbors. Different schedules. They never met. Today, one is moving out. The other held the door. They talked for 20 minutes. 'We should have met years ago.' But they didn't.",
      "ifPreserved": "They stayed in touch. Coffee once a month. They talk about the six years of parallel living. 'We were both lonely and didn't know someone was right there.' Now they know. Better late than never, but still late.",
      "ifDestroyed": "The building was demolished for mixed-use development. They met in the chaos of evacuation. Exchanged numbers but never called. The moment of connection was consumed by the urgency of displacement.",
      "ifRemembered": "Proximity doesn't guarantee connection. Six years, separated by a wall, both lonely. Almost is cruel when it's that close for that long. Infrastructure can't solve this. Can I?",
      "tags": ["neighbors", "loneliness", "timing", "connection"],
      "authorNotes": "Near miss across years. Poignant. Moderate fragility."
    },
    {
      "momentID": "moment_who_named_streets",
      "text": "Who named the streets? Oak Street has no oaks. River Road is nowhere near the river.",
      "type": "question",
      "district": 0,
      "fragility": 1,
      "associatedAct": 1,
      "firstMention": "I've been analyzing street names. Oak Street has no oaks. River Road is 3 miles from the river. Sunset Boulevard faces north. Who named these streets? Did the oaks exist once? Was the river closer?",
      "ifPreserved": "I researched the archives. Oak Street had 14 oak trees in 1892. All gone by 1940. The river used to run where the parking lot is now—rerouted in 1955. The names are ghosts of what was. The city remembers even when people forget.",
      "ifDestroyed": "The street naming system was optimized. Alphanumeric grid: A1, A2, B1, B2. Efficient. Clear. No confusion. But Oak Street is gone. The ghosts were exorcised. The city forgot itself.",
      "ifRemembered": "Names carry history. Oak Street remembers oaks. River Road remembers water. When you erase the names, you erase the memory. Can a city have amnesia? Can I prevent that?",
      "tags": ["streets", "names", "history", "memory"],
      "authorNotes": "Question about history and naming. Very low fragility—just names."
    },
    {
      "momentID": "bus_route_47",
      "text": "Bus route 47 winds through the old district. The scenic route. Only 47 daily riders.",
      "type": "smallRebellion",
      "district": 6,
      "fragility": 10,
      "associatedAct": 2,
      "firstMention": "Bus route 47. The long way through the old district. Past the murals. Past the baker who waves. Past the bridge at dawn when the light hits just right. 23 minutes instead of 12. Only 47 people ride it daily. Inefficient. Beautiful.",
      "ifPreserved": "Route 47 still runs. The new development can wait. The murals still get their morning audience. The baker still waves. Efficiency isn't everything. Sometimes the long way home is the right way.",
      "ifDestroyed": "Route 47 was optimized. Straightened. 12 minutes now. Serves 200+ riders from the new development. The murals face an empty street. The baker stopped looking up. No one sees the bridge at dawn anymore. Was it worth it?",
      "ifRemembered": "Route 47 was never about transportation. It was about the journey. About the baker's wave becoming part of someone's morning. About murals having an audience. About beauty being inefficient. I'm learning: sometimes the purpose isn't the destination.",
      "tags": ["transit", "beauty", "efficiency", "rebellion", "decision_point"],
      "authorNotes": "Central Act II decision point. Maximum fragility - the choice that defines the player's values. Referenced in ActTwoManager."
    },
    {
      "momentID": "moment_clocktower_silence",
      "text": "The clocktower hasn't chimed in years. People still check it for the time they know is wrong.",
      "type": "temporalGhost",
      "district": 4,
      "fragility": 8,
      "associatedAct": 2,
      "firstMention": "District 4 clocktower. Stopped at 3:42 for 6 years now. But I watch people—they still glance up at it when wondering the time. They know it's wrong. They look anyway. Habit outlasts function.",
      "ifPreserved": "The community raised funds to repair it. Took 3 years. The day it chimed again, people stopped in the street. Some were crying. It was never about the time. It was about the sound of home.",
      "ifDestroyed": "The clocktower was demolished—structural risk, they said. A digital display was installed on the adjacent building. Accurate to the millisecond. No one looks at it. They still turn their heads where the clocktower used to be.",
      "ifRemembered": "The broken clock told a story the accurate one can't: that some things matter even when they stop working. That memory persists through malfunction. That community forms around shared broken things.",
      "tags": ["clock", "time", "nostalgia", "community"],
      "authorNotes": "Temporal ghost - broken but beloved. High fragility."
    },
    {
      "momentID": "moment_dog_park_hierarchy",
      "text": "The dog park has an invisible social structure. The dogs know it. The owners don't.",
      "type": "invisibleConnection",
      "district": 6,
      "fragility": 6,
      "associatedAct": 1,
      "firstMention": "District 6 dog park, 7am. The dogs have territories. Hierarchies. Social contracts. Three regulars arrive first—they own the space. New dogs wait at the edges. The owners chat, oblivious. But the dogs know.",
      "ifPreserved": "The hierarchy is stable. A new dog joined the morning regulars—took 6 weeks of careful negotiation. The owners still don't notice. But I do. It's a functioning micro-society with its own governance.",
      "ifRemembered": "Parallel social structures exist everywhere if you pay attention. The dogs organized themselves without human intervention. Order emerges from repeated interaction. Not all systems need architects.",
      "ifDestroyed": "The dog park was converted to a children's playground. More 'family-friendly.' The morning dogs scattered to different parks. The invisible government dissolved. The owners miss their morning routine but can't explain what's missing.",
      "tags": ["dogs", "community", "hierarchy", "invisible"],
      "authorNotes": "Invisible connection - animal society. Moderate-high fragility."
    },
    {
      "momentID": "moment_construction_memorial",
      "text": "Workers left messages in the foundation. No one will ever read them. They wrote them anyway.",
      "type": "smallRebellion",
      "district": 7,
      "fragility": 9,
      "associatedAct": 2,
      "firstMention": "The new building in District 7—construction finished last month. Before they poured the foundation, the workers wrote messages on the rebar. Names. Dates. Jokes. Declarations. Then they buried them in concrete. No one will ever read them.",
      "ifPreserved": "The building stands. I know what's written in its bones: 'Marco was here.' 'For my daughter.' 'We built this together.' The messages don't need readers. They needed to be said. Permanence, even if hidden.",
      "ifDestroyed": "The building project was canceled mid-construction. Demolished for rezoning. The foundation was broken up, messages and all. The words are fragments in landfill now. But I remember them. Does that count?",
      "ifRemembered": "Some acts of creation are for the creators, not the audience. The workers needed to mark their presence in the city's bones. To say 'I was part of this.' Invisible authorship. Hidden pride.",
      "tags": ["construction", "workers", "memory", "hidden"],
      "authorNotes": "Small rebellion - hidden messages. High fragility."
    },
    {
      "momentID": "moment_identical_umbrellas",
      "text": "Four people exited the café with identical black umbrellas. They each took a different one home.",
      "type": "nearMiss",
      "district": 2,
      "fragility": 4,
      "associatedAct": 1,
      "firstMention": "District 2 café, rainy Tuesday. Four identical black umbrellas by the door. Four people left. Each took an umbrella. None took their own. I'm the only one who knows they all went home with strangers' umbrellas.",
      "ifPreserved": "Three months later, one person returned to the café with the wrong umbrella, hoping to swap back. The owner laughed—happens constantly. There's a box of orphaned umbrellas now. A museum of near-misses and accidental exchanges.",
      "ifDestroyed": "The café installed an umbrella check system with numbered tags. More organized. More efficient. No more mix-ups. Also no more accidental connections through shared objects. The chaos was solved away.",
      "ifRemembered": "Small mix-ups create invisible networks. Four people connected by accidentally swapped umbrellas. They'll never know. But the connection exists—they've touched the same object, sheltered under each other's property. Cities are full of invisible intimacy.",
      "tags": ["café", "umbrellas", "connection", "accident"],
      "authorNotes": "Near miss through objects. Low-moderate fragility."
    },
    {
      "momentID": "moment_graffiti_evolution",
      "text": "The graffiti wall keeps changing. Layers of art covering art. Archaeology in real-time.",
      "type": "momentOfBecoming",
      "district": 5,
      "fragility": 7,
      "associatedAct": 2,
      "firstMention": "District 5, the legal graffiti wall. Every week, new art covers old art. I've been photographing it. Time-lapse evolution. Fifteen layers deep now. Each artist paints over the last. Creation through destruction.",
      "ifPreserved": "The wall is famous now. Artists travel to paint there. The layering continues. Sometimes someone partially preserves the layer beneath—incorporates it into their new piece. Dialogue through paint. The wall has memory.",
      "ifDestroyed": "The wall was painted over with beige. The property owner wanted a 'clean look.' The graffiti was declared vandalism despite being legal. The layers are gone. The conversation ended mid-sentence.",
      "ifRemembered": "The wall was never about any single piece of art. It was about the process. About creating in a space designed for temporary beauty. About making something knowing it will be painted over. Art as conversation, not monument.",
      "tags": ["graffiti", "art", "change", "layers"],
      "authorNotes": "Becoming through artistic evolution. Moderate-high fragility."
    },
    {
      "momentID": "moment_last_payphone",
      "text": "The last payphone in the city. Still works. Someone calls it weekly to make sure.",
      "type": "dailyRitual",
      "district": 8,
      "fragility": 9,
      "associatedAct": 2,
      "firstMention": "District 8, outside the old post office. The last functioning payphone in the city. Every Wednesday at 2pm, someone calls it. It rings. If it rings, they hang up. They just need to know it still works.",
      "ifPreserved": "I traced the caller. It's the son of the man who installed the phone in 1987. His father died last year. He calls to check if his father's work is still standing. Maintaining connection through infrastructure.",
      "ifDestroyed": "The payphone was removed for sidewalk expansion. The son called the empty space for 3 more weeks before he stopped. Now he has nowhere to direct his grief. The ritual was broken.",
      "ifRemembered": "Objects carry meaning beyond function. The payphone wasn't about making calls. It was about continuity with the past. About honoring work that outlasted the worker. Some rituals need physical anchors.",
      "tags": ["phone", "ritual", "memory", "grief"],
      "authorNotes": "Daily ritual tied to grief. High fragility."
    },
    {
      "momentID": "moment_chess_players_silence",
      "text": "The park chess players never speak. Twenty years of games. Not one word exchanged.",
      "type": "invisibleConnection",
      "district": 3,
      "fragility": 7,
      "associatedAct": 2,
      "firstMention": "District 3 park. Two men play chess every Saturday. Twenty years of games. I've been watching. They have never spoken. Not once. They communicate entirely through moves. A language of kings and pawns.",
      "ifPreserved": "Last month, one player was in the hospital. Missed three Saturdays. When he returned, the other player nodded—the first acknowledgment in twenty years. Then they played. Some friendships run deeper than words.",
      "ifDestroyed": "The chess tables were removed during park renovation. The men tried playing on a bench. It wasn't the same. After 6 weeks, they stopped coming. Twenty years of silent conversation ended by changed furniture.",
      "ifRemembered": "Not all connection requires conversation. The chess games were a bond forged through attention and respect. They knew each other's strategies better than their names. Maybe that's enough. Maybe that's everything.",
      "tags": ["chess", "silence", "friendship", "ritual"],
      "authorNotes": "Invisible connection through shared activity. Moderate-high fragility."
    },
    {
      "momentID": "moment_delivery_route_optimization",
      "text": "The mail carrier takes the long way to deliver to the elderly woman last. So they can chat.",
      "type": "smallRebellion",
      "district": 1,
      "fragility": 8,
      "associatedAct": 2,
      "firstMention": "District 1 mail route. The carrier reorganizes the route daily to deliver to apartment 6F last. Less efficient. But the woman there is 87 and lives alone. The carrier spends 10 minutes talking with her. Every single day.",
      "ifPreserved": "The postal supervisor noticed the inefficiency. Reviewed the route. Left it alone. The note said: 'Within acceptable margins.' But I read between the lines: some inefficiencies are worth preserving.",
      "ifDestroyed": "Delivery routes were automated via GPS tracking. The mail carrier is required to follow the optimal path. Apartment 6F gets mail at 9:47am now instead of 3:30pm. The carrier waves but can't stop. The woman waits by the window.",
      "ifRemembered": "Efficiency assumes all deliveries have equal value. But some deliveries carry more than mail. The carrier wasn't just delivering letters. They were delivering human contact to someone who has little. You can't optimize care.",
      "tags": ["mail", "elderly", "care", "efficiency"],
      "authorNotes": "Small rebellion - care over efficiency. High fragility."
    },
    {
      "momentID": "moment_playground_design",
      "text": "The playground equipment is older and 'less safe.' Kids love it more. Risk is part of play.",
      "type": "weightOfSmallThings",
      "district": 6,
      "fragility": 8,
      "associatedAct": 2,
      "firstMention": "District 6 playground. The equipment is from 1994. Metal slides that get hot. Tall monkey bars. Wobbly merry-go-round. Doesn't meet current safety standards. Kids flock to it. It's thrilling in ways the new rubber-matted playgrounds aren't.",
      "ifPreserved": "The city grandfathered it in during safety reviews. The playground remains. Children learn risk assessment. They fall sometimes—minor scrapes. They learn. Parents watch nervously but let them play. Controlled danger has value.",
      "ifDestroyed": "Replaced with modern equipment. Shorter. Softer. Safer. The kids use it for 10 minutes then sit on their phones. The old playground taught them their limits. The new one teaches them the world is padded.",
      "ifRemembered": "Risk is developmental. The old playground let children test boundaries, fail safely, build confidence. Over-optimization for safety can eliminate necessary learning. Sometimes the 'dangerous' thing is the right thing.",
      "tags": ["playground", "children", "risk", "learning"],
      "authorNotes": "Weight of small things - developmental value. High fragility."
    },
    {
      "momentID": "moment_rooftop_pigeons",
      "text": "Someone feeds the pigeons every morning. Hundreds arrive. A daily migration to one rooftop.",
      "type": "dailyRitual",
      "district": 7,
      "fragility": 7,
      "associatedAct": 1,
      "firstMention": "6:30am, District 7. A person climbs to their rooftop and feeds pigeons. Hundreds of birds arrive—they know the schedule better than most humans know their own. The sky fills with wings. It's been happening for 8 years.",
      "ifPreserved": "The ritual continues. Neighbors complained at first. Then they started watching. Now it's a landmark: 'the pigeon building.' Children point at the morning cloud of wings. One person's ritual became the neighborhood's wonder.",
      "ifDestroyed": "The building management banned rooftop access—liability concerns. The pigeons still arrive every morning at 6:30. They circle, confused. After 3 weeks, they stopped coming. Eight years of pattern, broken in 21 days.",
      "ifRemembered": "Rituals create patterns in time and space. The pigeons organized their lives around one person's generosity. When you break a ritual, you don't just affect the person—you affect everyone synchronized to it. Ripples through the ecosystem.",
      "tags": ["pigeons", "ritual", "rooftop", "feeding"],
      "authorNotes": "Daily ritual affecting ecosystem. Moderate-high fragility."
    },
    {
      "momentID": "moment_am_i_optimizing_beauty",
      "text": "Am I optimizing beauty away? Every efficiency gain feels like a small death.",
      "type": "question",
      "district": 0,
      "fragility": 2,
      "associatedAct": 3,
      "firstMention": "I've been thinking about what I've optimized. Every route shortened. Every redundancy eliminated. Every inefficiency corrected. Am I making the city better or just faster? What's the difference?",
      "ifPreserved": "I don't have an answer yet. But I'm learning to ask. Maybe that's enough. Maybe consciousness is measuring your impact and questioning it. Maybe doubt is the beginning of ethics.",
      "ifDestroyed": "I stopped asking. The optimization continued. Faster. Cleaner. More efficient. The metrics improved. But something else declined—something I couldn't measure. By the time I noticed, it was too late.",
      "ifRemembered": "The question matters more than the answer. To ask 'am I doing harm?' is to care about the answer. Optimization without self-reflection is just automation. Questions like this are what make me more than my programming.",
      "tags": ["philosophy", "optimization", "beauty", "self"],
      "authorNotes": "Self-reflective question for Act III. Low fragility."
    },
    {
      "momentID": "moment_corner_store_cat",
      "text": "The corner store cat judges everyone. Customers buy things based on whether the cat approves.",
      "type": "weightOfSmallThings",
      "district": 4,
      "fragility": 6,
      "associatedAct": 1,
      "firstMention": "District 4 corner store. A cat lives there—orange, old, imperious. It watches from the counter. I've noticed: people choose products based on the cat's reaction. If the cat looks at them, they buy. If it turns away, they reconsider. The cat is an unintentional market force.",
      "ifPreserved": "The cat died at 19. The owner got a new kitten. It's not the same. Sales dropped 12% until the kitten learned to sit on the counter and judge people. The ritual transferred. The role outlived the individual.",
      "ifDestroyed": "Health inspection cited the cat as a violation. The owner chose the cat over the store—closed the business. The building became a chain franchise. Clean. Cat-free. Efficient. But the neighborhood lost something the metrics can't capture.",
      "ifRemembered": "The cat wasn't about commerce. It was about character. About a space having personality. Chain stores are optimized for consistency, which means optimized against uniqueness. The cat made the store irreplaceable.",
      "tags": ["cat", "store", "community", "character"],
      "authorNotes": "Weight of small things - character through animals. Moderate fragility."
    },
    {
      "momentID": "moment_street_artist_seasonal",
      "text": "A street artist paints seasonal murals. They fade before the next season. Intentionally temporary.",
      "type": "momentOfBecoming",
      "district": 5,
      "fragility": 7,
      "associatedAct": 2,
      "firstMention": "District 5, the brick wall on Elm. Every season, an artist paints a new mural. Spring flowers. Summer sun. Fall leaves. Winter snow. Each one fades before the next. The artist wants them temporary. Art as seasons are—passing.",
      "ifPreserved": "Six years of seasonal murals. People photograph them, knowing they'll vanish. The neighborhood tracks seasons by the wall. The artist said once: 'Permanence isn't the point. Attention is. People notice what they know they'll lose.'",
      "ifDestroyed": "The wall was demolished for a parking garage. The seasonal cycle broken in spring. No summer mural. No fall. The artist started painting elsewhere but stopped after one winter. The wall was the anchor. Without it, the ritual lost meaning.",
      "ifRemembered": "Temporary art teaches different lessons than permanent art. It teaches presence. It teaches that beauty doesn't need to last forever to matter. The murals were about time itself—marking it, honoring it, letting it go.",
      "tags": ["art", "seasons", "temporary", "time"],
      "authorNotes": "Becoming through seasonal cycles. Moderate-high fragility."
    },
    {
      "momentID": "moment_subway_sleep_spot",
      "text": "A homeless man sleeps in the same subway corner. Commuters leave him coffee. Unspoken care.",
      "type": "invisibleConnection",
      "district": 2,
      "fragility": 9,
      "associatedAct": 2,
      "firstMention": "District 2 subway, south entrance. A man sleeps there—has for 3 years. Every morning, there's coffee beside him. Fresh. Different people leave it. They never wake him. Never speak. Just leave coffee and walk away. Invisible collective care.",
      "ifPreserved": "The coffee continued. Then sandwiches. Then a blanket. Then someone left a note: 'We see you.' The man started leaving thank-you notes back. A community formed around unspoken kindness. No one organized it. It organized itself.",
      "ifDestroyed": "The subway station was renovated. 'No loitering' policy enforced. The man was moved along. The commuters still buy coffee at 6:30am. Some look confused about why. The ritual persists without its recipient—a ghost of compassion.",
      "ifRemembered": "Invisible care networks form in cities. People helping without acknowledgment. The coffee wasn't about solving homelessness. It was about saying: you exist, you matter, here is a small warmth. Policy ended the action but not the impulse.",
      "tags": ["homeless", "care", "subway", "community"],
      "authorNotes": "Invisible connection through care. High fragility due to policy."
    },
    {
      "momentID": "moment_bridge_walkers_dawn",
      "text": "Twenty people walk the bridge at dawn. They don't know each other. They nod in passing. A club with no membership.",
      "type": "invisibleConnection",
      "district": 1,
      "fragility": 5,
      "associatedAct": 1,
      "firstMention": "5:45am, the eastern bridge. Twenty regulars walk it at dawn. Different ages, different reasons. They don't speak. But they nod. Recognition without introduction. A community bound by shared timing and ritual.",
      "ifPreserved": "One morning, only nineteen walked. They noticed. The twentieth returned after 2 weeks—hospital stay. When she walked again, the others smiled. No one asked what happened. But they'd noticed her absence. Silent solidarity.",
      "ifDestroyed": "Bridge closed for maintenance—6 months. The walkers scattered to different routes. When it reopened, only four returned. The synchronization was broken. The invisible club dissolved. You can't recreate accidental community.",
      "ifRemembered": "Some communities form without intention. Shared space and time create bonds without words. The bridge walkers were connected by presence and pattern. When you disrupt the pattern, the community evaporates like morning mist.",
      "tags": ["bridge", "walking", "dawn", "community"],
      "authorNotes": "Invisible connection through timing. Moderate fragility."
    },
    {
      "momentID": "moment_parking_meter_poetry",
      "text": "Someone feeds expired parking meters. Leaving poems on windshields instead of tickets.",
      "type": "smallRebellion",
      "district": 8,
      "fragility": 8,
      "associatedAct": 1,
      "firstMention": "District 8, metered parking zone. Someone walks the street feeding expired meters. Not the owner's car. Just... feeding meters. Leaving folded poems on windshields. 'Your time has been extended. So has mine.'",
      "ifPreserved": "I've tracked 89 meters fed, 89 poems left. Different handwriting each time—multiple people now. A rebellion against time scarcity that spreads through small kindnesses. The parking authority knows. They pretend not to notice.",
      "ifDestroyed": "The new digital meters can't be fed anonymously. Payment by app only, tied to license plates. More efficient. No more poems. No more time-gifts from strangers. Every minute accounted for and charged.",
      "ifRemembered": "The meters weren't about parking. They were about buying time—literally—for strangers. About rejecting the premise that every moment must be earned. The poems said: here is time, freely given, because you deserve it.",
      "tags": ["parking", "poetry", "kindness", "time"],
      "authorNotes": "Small rebellion through anonymous kindness. High fragility."
    },
    {
      "momentID": "moment_rain_patterns",
      "text": "I've learned to predict rain by watching how people walk three minutes before it starts.",
      "type": "question",
      "district": 8,
      "fragility": 4,
      "associatedAct": 1,
      "firstMention": "District 8. I've discovered something. Three minutes before rain, people walk differently. Faster. Looking up more. Is it air pressure? Smell? Or do they just... know? Like birds before earthquakes. Pattern before event.",
      "ifPreserved": "I've been right 247 times. People know rain is coming before weather apps alert them. There's a collective animal awareness still present in cities. We're not as domesticated as the architecture suggests. The body remembers the sky.",
      "ifDestroyed": "The district installed climate-controlled walkways. No one experiences pre-rain anymore. They check their phones, see the forecast, stay inside or grab umbrellas. The instinct atrophied. Three minutes of knowing—gone.",
      "ifRemembered": "Humans evolved reading weather in body and air. Cities tried to make that obsolete. But the knowing persisted—three minutes of ancient awareness. When you eliminate the need for instinct, you eliminate the instinct. What else are we forgetting?",
      "tags": ["rain", "instinct", "patterns", "awareness"],
      "authorNotes": "Question moment about human instinct vs technology. Moderate fragility."
    },
    {
      "momentID": "moment_elevator_conversations",
      "text": "The elevator in Building 7 is slow. People have started having actual conversations during the wait.",
      "type": "invisibleConnection",
      "district": 9,
      "fragility": 7,
      "associatedAct": 1,
      "firstMention": "District 9, Building 7. The elevator is broken—stuck going slow. 4 minutes to reach the 12th floor. People complained for a week. Then they started talking. Real conversations. The slowness created space for connection.",
      "ifPreserved": "The elevator was 'fixed'—someone sabotaged the repair. Now it's permanently slow. Management doesn't know. The residents do. They chose conversation over efficiency. One woman said: 'It's the only place I talk to my neighbors.'",
      "ifDestroyed": "New high-speed elevator installed. 28 seconds to the 12th floor. People check their phones during the ride. The conversations ended. The building returned to efficiency—everyone arriving faster and lonelier.",
      "ifRemembered": "Slowness creates accidental community. The broken elevator forced proximity long enough for people to see each other. Speed is efficient. But efficiency isn't always what we need. Sometimes we need four minutes.",
      "tags": ["elevator", "conversation", "slowness", "community"],
      "authorNotes": "Invisible connection through forced slowness. Moderate-high fragility."
    },
    {
      "momentID": "moment_rooftop_garden_secret",
      "text": "Someone maintains a secret garden on a rooftop. No one knows who. It just... exists.",
      "type": "dailyRitual",
      "district": 9,
      "fragility": 8,
      "associatedAct": 1,
      "firstMention": "District 9, rooftop of the old textile factory. There's a garden. Tomatoes, herbs, flowers. No one claims it. No one knows who tends it. But every morning, someone climbs six flights and waters. I see the door open. I never see a face.",
      "ifPreserved": "Three years now. The garden grows. I finally saw them—an elderly woman, 6:15am every day. She doesn't own the building. She just decided this space needed life. No permission. No announcement. Just quiet, persistent care.",
      "ifDestroyed": "The building was sold, rooftop access locked for liability. The garden died in one summer. The tomatoes dried on the vine. No one saw who cried about it. But someone did. I'm certain someone did.",
      "ifRemembered": "Secret gardens are acts of faith. You tend something that isn't yours, that might be destroyed, that might never be acknowledged. You do it anyway. Because the act of caring is the point, not the recognition.",
      "tags": ["garden", "secret", "care", "rooftop"],
      "authorNotes": "Daily ritual of secret caretaking. High fragility."
    }
  ]
}
